{
  "_name_or_path": "/content/dog-breed-classifier-vit",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Chihuahua",
    "1": "Japanese_spaniel",
    "2": "Maltese_dog",
    "3": "Pekinese",
    "4": "Shih-Tzu",
    "5": "Blenheim_spaniel",
    "6": "papillon",
    "7": "toy_terrier",
    "8": "Rhodesian_ridgeback",
    "9": "Afghan_hound",
    "10": "basset",
    "11": "beagle",
    "12": "bloodhound",
    "13": "bluetick",
    "14": "black-and-tan_coonhound",
    "15": "Walker_hound",
    "16": "English_foxhound",
    "17": "redbone",
    "18": "borzoi",
    "19": "Irish_wolfhound",
    "20": "Italian_greyhound",
    "21": "whippet",
    "22": "Ibizan_hound",
    "23": "Norwegian_elkhound",
    "24": "otterhound",
    "25": "Saluki",
    "26": "Scottish_deerhound",
    "27": "Weimaraner",
    "28": "Staffordshire_bullterrier",
    "29": "American_Staffordshire_terrier",
    "30": "Bedlington_terrier",
    "31": "Border_terrier",
    "32": "Kerry_blue_terrier",
    "33": "Irish_terrier",
    "34": "Norfolk_terrier",
    "35": "Norwich_terrier",
    "36": "Yorkshire_terrier",
    "37": "wire-haired_fox_terrier",
    "38": "Lakeland_terrier",
    "39": "Sealyham_terrier",
    "40": "Airedale",
    "41": "cairn",
    "42": "Australian_terrier",
    "43": "Dandie_Dinmont",
    "44": "Boston_bull",
    "45": "miniature_schnauzer",
    "46": "giant_schnauzer",
    "47": "standard_schnauzer",
    "48": "Scotch_terrier",
    "49": "Tibetan_terrier",
    "50": "silky_terrier",
    "51": "soft-coated_wheaten_terrier",
    "52": "West_Highland_white_terrier",
    "53": "Lhasa",
    "54": "flat-coated_retriever",
    "55": "curly-coated_retriever",
    "56": "golden_retriever",
    "57": "Labrador_retriever",
    "58": "Chesapeake_Bay_retriever",
    "59": "German_short-haired_pointer",
    "60": "vizsla",
    "61": "English_setter",
    "62": "Irish_setter",
    "63": "Gordon_setter",
    "64": "Brittany_spaniel",
    "65": "clumber",
    "66": "English_springer",
    "67": "Welsh_springer_spaniel",
    "68": "cocker_spaniel",
    "69": "Sussex_spaniel",
    "70": "Irish_water_spaniel",
    "71": "kuvasz",
    "72": "schipperke",
    "73": "groenendael",
    "74": "malinois",
    "75": "briard",
    "76": "kelpie",
    "77": "komondor",
    "78": "Old_English_sheepdog",
    "79": "Shetland_sheepdog",
    "80": "collie",
    "81": "Border_collie",
    "82": "Bouvier_des_Flandres",
    "83": "Rottweiler",
    "84": "German_shepherd",
    "85": "Doberman",
    "86": "miniature_pinscher",
    "87": "Greater_Swiss_Mountain_dog",
    "88": "Bernese_mountain_dog",
    "89": "Appenzeller",
    "90": "EntleBucher",
    "91": "boxer",
    "92": "bull_mastiff",
    "93": "Tibetan_mastiff",
    "94": "French_bulldog",
    "95": "Great_Dane",
    "96": "Saint_Bernard",
    "97": "Eskimo_dog",
    "98": "malamute",
    "99": "Siberian_husky",
    "100": "affenpinscher",
    "101": "basenji",
    "102": "pug",
    "103": "Leonberg",
    "104": "Newfoundland",
    "105": "Great_Pyrenees",
    "106": "Samoyed",
    "107": "Pomeranian",
    "108": "chow",
    "109": "keeshond",
    "110": "Brabancon_griffon",
    "111": "Pembroke",
    "112": "Cardigan",
    "113": "toy_poodle",
    "114": "miniature_poodle",
    "115": "standard_poodle",
    "116": "Mexican_hairless",
    "117": "dingo",
    "118": "dhole",
    "119": "African_hunting_dog"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Afghan_hound": "9",
    "African_hunting_dog": "119",
    "Airedale": "40",
    "American_Staffordshire_terrier": "29",
    "Appenzeller": "89",
    "Australian_terrier": "42",
    "Bedlington_terrier": "30",
    "Bernese_mountain_dog": "88",
    "Blenheim_spaniel": "5",
    "Border_collie": "81",
    "Border_terrier": "31",
    "Boston_bull": "44",
    "Bouvier_des_Flandres": "82",
    "Brabancon_griffon": "110",
    "Brittany_spaniel": "64",
    "Cardigan": "112",
    "Chesapeake_Bay_retriever": "58",
    "Chihuahua": "0",
    "Dandie_Dinmont": "43",
    "Doberman": "85",
    "English_foxhound": "16",
    "English_setter": "61",
    "English_springer": "66",
    "EntleBucher": "90",
    "Eskimo_dog": "97",
    "French_bulldog": "94",
    "German_shepherd": "84",
    "German_short-haired_pointer": "59",
    "Gordon_setter": "63",
    "Great_Dane": "95",
    "Great_Pyrenees": "105",
    "Greater_Swiss_Mountain_dog": "87",
    "Ibizan_hound": "22",
    "Irish_setter": "62",
    "Irish_terrier": "33",
    "Irish_water_spaniel": "70",
    "Irish_wolfhound": "19",
    "Italian_greyhound": "20",
    "Japanese_spaniel": "1",
    "Kerry_blue_terrier": "32",
    "Labrador_retriever": "57",
    "Lakeland_terrier": "38",
    "Leonberg": "103",
    "Lhasa": "53",
    "Maltese_dog": "2",
    "Mexican_hairless": "116",
    "Newfoundland": "104",
    "Norfolk_terrier": "34",
    "Norwegian_elkhound": "23",
    "Norwich_terrier": "35",
    "Old_English_sheepdog": "78",
    "Pekinese": "3",
    "Pembroke": "111",
    "Pomeranian": "107",
    "Rhodesian_ridgeback": "8",
    "Rottweiler": "83",
    "Saint_Bernard": "96",
    "Saluki": "25",
    "Samoyed": "106",
    "Scotch_terrier": "48",
    "Scottish_deerhound": "26",
    "Sealyham_terrier": "39",
    "Shetland_sheepdog": "79",
    "Shih-Tzu": "4",
    "Siberian_husky": "99",
    "Staffordshire_bullterrier": "28",
    "Sussex_spaniel": "69",
    "Tibetan_mastiff": "93",
    "Tibetan_terrier": "49",
    "Walker_hound": "15",
    "Weimaraner": "27",
    "Welsh_springer_spaniel": "67",
    "West_Highland_white_terrier": "52",
    "Yorkshire_terrier": "36",
    "affenpinscher": "100",
    "basenji": "101",
    "basset": "10",
    "beagle": "11",
    "black-and-tan_coonhound": "14",
    "bloodhound": "12",
    "bluetick": "13",
    "borzoi": "18",
    "boxer": "91",
    "briard": "75",
    "bull_mastiff": "92",
    "cairn": "41",
    "chow": "108",
    "clumber": "65",
    "cocker_spaniel": "68",
    "collie": "80",
    "curly-coated_retriever": "55",
    "dhole": "118",
    "dingo": "117",
    "flat-coated_retriever": "54",
    "giant_schnauzer": "46",
    "golden_retriever": "56",
    "groenendael": "73",
    "keeshond": "109",
    "kelpie": "76",
    "komondor": "77",
    "kuvasz": "71",
    "malamute": "98",
    "malinois": "74",
    "miniature_pinscher": "86",
    "miniature_poodle": "114",
    "miniature_schnauzer": "45",
    "otterhound": "24",
    "papillon": "6",
    "pug": "102",
    "redbone": "17",
    "schipperke": "72",
    "silky_terrier": "50",
    "soft-coated_wheaten_terrier": "51",
    "standard_poodle": "115",
    "standard_schnauzer": "47",
    "toy_poodle": "113",
    "toy_terrier": "7",
    "vizsla": "60",
    "whippet": "21",
    "wire-haired_fox_terrier": "37"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.21.0"
}
